# ExportEnergyModelType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GBXMLExportOptions..::..ExportEnergyModelType Property
GBXMLExportOptions Class See Also
---
The energy model type from which gbXML will be exported.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExportEnergyModelType ExportEnergyModelType { get; set; }
```

Visual Basic
---
```text
Public Property ExportEnergyModelType As ExportEnergyModelType
	Get
	Set
```

Visual C++
---
```text
public:
property ExportEnergyModelType ExportEnergyModelType {
	ExportEnergyModelType get ();
	void set (ExportEnergyModelType value);
}
```

# Remarks
Default value is SpatialElement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace